Table of Contents
 Interface IIdeaAnchorGrid
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Represent anchor grid extend IIdeaBoltGrid
public interface IIdeaAnchorGrid : IIdeaBoltGrid, IIdeaPersistentObject, IIdeaObject
Inherited Members
 IIdeaBoltGrid.Origin
 IIdeaBoltGrid.LocalCoordinateSystem
 IIdeaBoltGrid.Positions
 IIdeaBoltGrid.ConnectedParts
 IIdeaBoltGrid.ShearInThread
 IIdeaBoltGrid.BoltShearType
 IIdeaBoltGrid.BoltAssembly
 IIdeaPersistentObject.Token
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 AnchorType
Anchor Type
AnchorType AnchorType { get; }
Property Value
AnchorType
 ConcreteBlock
Concrete Block
IIdeaConcreteBlock ConcreteBlock { get; }
Property Value
IIdeaConcreteBlock
 WasherSize
Washer Size
double WasherSize { get; }
Property Value
double
 Edit this page